Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F04KL100.h
#define _NVMKEY_NVMKEY7_POSITION                 0x00000007
#define _NVMKEY_NVMKEY7_MASK                     0x00000080
#define _NVMKEY_NVMKEY7_LENGTH                   0x00000001

#define _ULPWCON_ULPSINK_POSITION                0x00000008
#define _ULPWCON_ULPSINK_MASK                    0x00000100
#define _ULPWCON_ULPSINK_LENGTH                  0x00000001

#define _ULPWCON_ULPSIDL_POSITION                0x0000000D
#define _ULPWCON_ULPSIDL_MASK                    0x00002000
#define _ULPWCON_ULPSIDL_LENGTH                  0x00000001

#define _ULPWCON_ULPEN_POSITION                  0x0000000F
#define _ULPWCON_ULPEN_MASK                      0x00008000
#define _ULPWCON_ULPEN_LENGTH                    0x00000001

#define _ULPWCON_CRNTEN_POSITION                 0x00000008
#define _ULPWCON_CRNTEN_MASK                     0x00000100
#define _ULPWCON_CRNTEN_LENGTH                   0x00000001

#define _ULPWCON_PSIDL_POSITION                  0x0000000D
#define _ULPWCON_PSIDL_MASK                      0x00002000
#define _ULPWCON_PSIDL_LENGTH                    0x00000001

#define _ULPWCON_WUEN_POSITION                   0x0000000F
#define _ULPWCON_WUEN_MASK                       0x00008000
#define _ULPWCON_WUEN_LENGTH                     0x00000001

#define _PMD1_U1MD_POSITION                      0x00000005
#define _PMD1_U1MD_MASK                          0x00000020
#define _PMD1_U1MD_LENGTH                        0x00000001

#define _PMD1_SSP1MD_POSITION                    0x00000007
#define _PMD1_SSP1MD_MASK                        0x00000080
#define _PMD1_SSP1MD_LENGTH                      0x00000001

#define _PMD1_T1MD_POSITION                      0x0000000B
#define _PMD1_T1MD_MASK                          0x00000800
#define _PMD1_T1MD_LENGTH                        0x00000001

#define _PMD1_T2MD_POSITION                      0x0000000C
#define _PMD1_T2MD_MASK                          0x00001000
#define _PMD1_T2MD_LENGTH                        0x00000001

#define _PMD1_T3MD_POSITION                      0x0000000D
#define _PMD1_T3MD_MASK                          0x00002000
#define _PMD1_T3MD_LENGTH                        0x00000001

#define _PMD1_I2C1MD_POSITION                    0x00000007
#define _PMD1_I2C1MD_MASK                        0x00000080
#define _PMD1_I2C1MD_LENGTH                      0x00000001

#define _PMD1_SPI1MD_POSITION                    0x00000007
#define _PMD1_SPI1MD_MASK                        0x00000080
#define _PMD1_SPI1MD_LENGTH                      0x00000001

#define _PMDIS1_U1MD_POSITION                    0x00000005
#define _PMDIS1_U1MD_MASK                        0x00000020
#define _PMDIS1_U1MD_LENGTH                      0x00000001

#define _PMDIS1_SSP1MD_POSITION                  0x00000007
#define _PMDIS1_SSP1MD_MASK                      0x00000080
#define _PMDIS1_SSP1MD_LENGTH                    0x00000001

#define _PMDIS1_T1MD_POSITION                    0x0000000B
#define _PMDIS1_T1MD_MASK                        0x00000800
#define _PMDIS1_T1MD_LENGTH                      0x00000001

#define _PMDIS1_T2MD_POSITION                    0x0000000C
#define _PMDIS1_T2MD_MASK                        0x00001000
#define _PMDIS1_T2MD_LENGTH                      0x00000001

#define _PMDIS1_T3MD_POSITION                    0x0000000D
#define _PMDIS1_T3MD_MASK                        0x00002000
#define _PMDIS1_T3MD_LENGTH                      0x00000001

#define _PMDIS1_I2C1MD_POSITION                  0x00000007
#define _PMDIS1_I2C1MD_MASK                      0x00000080
#define _PMDIS1_I2C1MD_LENGTH                    0x00000001

#define _PMDIS1_SPI1MD_POSITION                  0x00000007
#define _PMDIS1_SPI1MD_MASK                      0x00000080
#define _PMDIS1_SPI1MD_LENGTH                    0x00000001

#define _PMD2_CCP1MD_POSITION                    0x00000000
#define _PMD2_CCP1MD_MASK                        0x00000001
#define _PMD2_CCP1MD_LENGTH                      0x00000001

#define _PMD2_CCP2MD_POSITION                    0x00000001
#define _PMD2_CCP2MD_MASK                        0x00000002
#define _PMD2_CCP2MD_LENGTH                      0x00000001

#define _PMDIS2_CCP1MD_POSITION                  0x00000000
#define _PMDIS2_CCP1MD_MASK                      0x00000001
#define _PMDIS2_CCP1MD_LENGTH                    0x00000001

#define _PMDIS2_CCP2MD_POSITION                  0x00000001
#define _PMDIS2_CCP2MD_MASK                      0x00000002
#define _PMDIS2_CCP2MD_LENGTH                    0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_SPI2MD_POSITION                    0x00000001
#define _PMD3_SPI2MD_MASK                        0x00000002
#define _PMD3_SPI2MD_LENGTH                      0x00000001

#define _PMDIS3_CMPMD_POSITION                   0x0000000A
#define _PMDIS3_CMPMD_MASK                       0x00000400
#define _PMDIS3_CMPMD_LENGTH                     0x00000001

#define _PMDIS3_I2C2MD_POSITION                  0x00000001
#define _PMDIS3_I2C2MD_MASK                      0x00000002
#define _PMDIS3_I2C2MD_LENGTH                    0x00000001

#define _PMDIS3_SPI2MD_POSITION                  0x00000001
#define _PMDIS3_SPI2MD_MASK                      0x00000002
#define _PMDIS3_SPI2MD_LENGTH                    0x00000001

#define _PMD4_HLVDMD_POSITION                    0x00000001
#define _PMD4_HLVDMD_MASK                        0x00000002
#define _PMD4_HLVDMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_ULPWUMD_POSITION                   0x00000007
#define _PMD4_ULPWUMD_MASK                       0x00000080
#define _PMD4_ULPWUMD_LENGTH                     0x00000001

#define _PMDIS4_HLVDMD_POSITION                  0x00000001
#define _PMDIS4_HLVDMD_MASK                      0x00000002
#define _PMDIS4_HLVDMD_LENGTH                    0x00000001

#define _PMDIS4_REFOMD_POSITION                  0x00000003
#define _PMDIS4_REFOMD_MASK                      0x00000008
#define _PMDIS4_REFOMD_LENGTH                    0x00000001

#define _PMDIS4_ULPWUMD_POSITION                 0x00000007
#define _PMDIS4_ULPWUMD_MASK                     0x00000080
#define _PMDIS4_ULPWUMD_LENGTH                   0x00000001



